reporte/statistics.json
{
  "GET /error" : {
    "transaction" : "GET /error",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 3.9000000000000012,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 5.899999999999999,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 7.0,
    "throughput" : 4.76417341591234,
    "receivedKBytesPerSec" : 1.2468735111958076,
    "sentKBytesPerSec" : 0.6932244521200572
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 300,
    "errorCount" : 50,
    "errorPct" : 16.666666,
    "meanResTime" : 255.7566666666667,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 1554.0,
    "pct1ResTime" : 1510.0,
    "pct2ResTime" : 1516.95,
    "pct3ResTime" : 1520.0,
    "throughput" : 24.848836246169135,
    "receivedKBytesPerSec" : 23.393577740619563,
    "sentKBytesPerSec" : 3.8381421871117367
  },
  "GET /users" : {
    "transaction" : "GET /users",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.56,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 42.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 42.0,
    "throughput" : 4.762811964183655,
    "receivedKBytesPerSec" : 21.191629506810823,
    "sentKBytesPerSec" : 0.6930263502571918
  },
  "GET /users/1" : {
    "transaction" : "GET /users/1",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.8,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 5.899999999999999,
    "pct2ResTime" : 6.8999999999999915,
    "pct3ResTime" : 11.0,
    "throughput" : 4.762811964183655,
    "receivedKBytesPerSec" : 1.0604698514002668,
    "sentKBytesPerSec" : 0.7023287173747381
  },
  "GET /slow" : {
    "transaction" : "GET /slow",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1513.36,
    "medianResTime" : 1513.0,
    "minResTime" : 1503.0,
    "maxResTime" : 1554.0,
    "pct1ResTime" : 1519.0,
    "pct2ResTime" : 1531.25,
    "pct3ResTime" : 1554.0,
    "throughput" : 4.1652782405864714,
    "receivedKBytesPerSec" : 0.9762370876374542,
    "sentKBytesPerSec" : 0.6345541069643452
  },
  "GET /health" : {
    "transaction" : "GET /health",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.6,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.8999999999999915,
    "pct3ResTime" : 39.0,
    "throughput" : 4.746084480303749,
    "receivedKBytesPerSec" : 1.1494423350735643,
    "sentKBytesPerSec" : 0.6952272187944946
  },
  "POST /users" : {
    "transaction" : "POST /users",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.319999999999998,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 11.0,
    "throughput" : 4.7614512903533,
    "receivedKBytesPerSec" : 1.1345645652794973,
    "sentKBytesPerSec" : 0.902071826492715
  }
}